Simulation_code/baseCases/base_PB/0/phiE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phiE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    elecNorth
    {
	type            fixedValue;
	value           uniform 0.012926;      
    }
   
    elecSouth
    {
	type            fixedValue;
	value           uniform -0.012926;        
    }
    
    cylinder
    {
	type            zeroGradient;
    }

    "wall.*"
    {
	type            zeroGradient;    
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
